uxabix/STM32F103C6BenchPowerSupply/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2025 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f1xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

void HAL_TIM_MspPostInit(TIM_HandleTypeDef *htim);

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define LED_Pin GPIO_PIN_13
#define LED_GPIO_Port GPIOC
#define Ch5_In_Pin GPIO_PIN_14
#define Ch5_In_GPIO_Port GPIOC
#define Fan_out_Pin GPIO_PIN_0
#define Fan_out_GPIO_Port GPIOA
#define Ch1_Temp_Pin GPIO_PIN_5
#define Ch1_Temp_GPIO_Port GPIOA
#define Ch2_Temp_Pin GPIO_PIN_6
#define Ch2_Temp_GPIO_Port GPIOA
#define Ch3_Temp_Pin GPIO_PIN_7
#define Ch3_Temp_GPIO_Port GPIOA
#define Ch4_Temp_Pin GPIO_PIN_0
#define Ch4_Temp_GPIO_Port GPIOB
#define Ch5_Temp_Pin GPIO_PIN_1
#define Ch5_Temp_GPIO_Port GPIOB
#define Ch5_Out_Pin GPIO_PIN_12
#define Ch5_Out_GPIO_Port GPIOB
#define Ch4_Out_Pin GPIO_PIN_13
#define Ch4_Out_GPIO_Port GPIOB
#define Ch3_Out_Pin GPIO_PIN_14
#define Ch3_Out_GPIO_Port GPIOB
#define Ch1_Out_Pin GPIO_PIN_15
#define Ch1_Out_GPIO_Port GPIOB
#define Ch2_Out_Pin GPIO_PIN_8
#define Ch2_Out_GPIO_Port GPIOA
#define Ch1_In_Pin GPIO_PIN_15
#define Ch1_In_GPIO_Port GPIOA
#define Ch2_In_Pin GPIO_PIN_3
#define Ch2_In_GPIO_Port GPIOB
#define Ch3_In_Pin GPIO_PIN_4
#define Ch3_In_GPIO_Port GPIOB
#define Ch4_In_Pin GPIO_PIN_5
#define Ch4_In_GPIO_Port GPIOB

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
